src/СРМ/src/Catalogs/RA_RedmineЗадачи/RA_RedmineЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RA_RedmineЗадачи</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.RA_RedmineПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Трекер</name>
    <type>
      <types>CatalogRef.RA_RedmineТрекеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.RA_RedmineСтатусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.RA_RedmineПриоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.RA_RedmineПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.RA_RedmineКатегорииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StoryPoints</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.RA_RedmineПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактОбращения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/СРМ/src/InformationRegisters/RA_RedmineИсторияСтатусовЗадач/RA_RedmineИсторияСтатусовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>RA_RedmineИсторияСтатусовЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.RA_RedmineСтатусы</types>
    </type>
  </resources>
  <resources>
    <name>ПредыдущийСтатус</name>
    <type>
      <types>CatalogRef.RA_RedmineСтатусы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.RA_RedmineПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.RA_RedmineЗадачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/СРМ/src/Catalogs/RA_RedmineЗадачи/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// запишем статус Новый на дату создания задачи
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		
		Запись = РегистрыСведений.RA_RedmineИсторияСтатусовЗадач.СоздатьМенеджерЗаписи();
		Запись.Период = ДатаСоздания;
		Запись.Задача = Ссылка;
		Запись.Статус = RA_RedmineПротоколПодключенияПовтИсп.СтатусЗадачиНовый();
		Запись.Пользователь = Автор;
		Запись.Комментарий = "Установлен автоматически при создании задачи";
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
